# -*- coding: utf-8 -*-
"""
Created on Thu Jun 11 13:24:43 2020

@author: oboro
"""

et_mas = {'h': "Факторы h и s составляют вектор S сексуальные влечения\nФактор h - женственность, символ материнства. Фактор h эрос- фактор.\n", 
          's': "Фактор s - мужественность, символ отцовства. Это фактор деструкции, танатос- фактор.\n",
          'e': "Факторы е и hy составляют вектор Р -выявляющий пароксизмальность влечений, влечение к демонстративности и этико-моральному поведению.\nФактор е: каиновы и авелевы потребности. Желание убить и внутренний закон, запрещающий убийство. Этос -фактор.\n",
          'hy': "Фактор hy: потребность в славе, эксгибиционизм, подавляемый застенчивостью. Это фактор морали.\n", 
          'k': "Факторы k и p составляют Sch- вектор, Я влечение. Обладание и бытие.\nФактор k: сужение Я, эгосистола. Материальное Я, стремящееся к обладанию, фактор систолы.\n",
          'p': "Фактор р: расширение Я, эго- диастола. Духовное Я. Фактор диастолы.", 
          'd': "Факторы d и m составляют С -вектор, влечение к контактам, социальная вовлеченность.\nФактор d: потребность в обретении, в поиске и прилипании. Фактор верности или неверности.\n", 
          'm': "Фактор m: Потребность 'цепляния и отвязывания'."}

et1_mas = {'h': {'+': None, '-': None}, 's': {'+': None, '-': None}, 'e': {'+': None, '-': None}, 
           'hy': {'+': None, '-': None}, 'k': {'+': None, '-': None}, 'p': {'+': None, '-': None}, 
           'd': {'+': None, '-': None}, 'm': {'+': None, '-': None}}

et1_mas['h']['+'] = 'h+ тенденция к персональной нежности и любви.'
et1_mas['h']['-'] = 'h- тенденция к коллективной, гуманизированной нежности, к общечеловеческой любви.'
et1_mas['s']['+'] = 's+ тенденция к садизму, агрессивность, активность.'
et1_mas['s']['-'] = 's- тенденция к цивилизации, к коллективизму и самопожертвованию, к смирению, пассивности и мазохизму.'
et1_mas['e']['+'] = 'е+ тенденция к добру, к коллективной справедливости. Терпимость, благожелательность, готовность помогать, религиозность, кротость, черты Авеля.'
et1_mas['e']['-'] = 'е- тенденция к злобности, к накоплению ярости, ненависти, гневливость, нетерпимость, черты Каина.'
et1_mas['hy']['+'] = 'hy+ тенденция к демонстративности, эксгибиционизм, тщеславие'
et1_mas['hy']['-'] = 'hy- тенденция к социальной стыдливости. Склонность к фантазированию.'
et1_mas['k']['+'] = 'k+ тенденция к аутизму, эгоцентризму, нарциссизму. Интроэкция. Стремление к власти через обладание.'
et1_mas['k']['-'] = 'k- стремление приспособиться к коллективу, тенденция к отречению и деструкции своего Я.'
et1_mas['p']['+'] = 'р+ тенденция к расширению Я, к Я- инфляции, к власти через бытие. Амбитендентность.'
et1_mas['p']['-'] = 'р- тенденция к паритципации, т.е. к единству и тождеству с другими, склонность к проекции (приписыванию другим своих суждений и представлений)'
et1_mas['d']['+'] = 'd+ тенденция к обретению ценностей в ущерб другим, к поиску новых объектов, склонность к неверности и измене.'
et1_mas['d']['-'] = 'd- тенденция к самоотверженности, преданности и верности. Склонность к анальности и прилипанию к объекту привязанности.'
et1_mas['m']['+'] = 'm+ тенденция к цеплянию за привычное, к оральности, к гедонизму.'
et1_mas['m']['-'] = 'm- тенденция к отрыву, к одиночеству.'

        

